
print(f'''\033[1;37m \033[2m
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸⠋⣋⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣉⣋⠹⠂⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⢸⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡇⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⠆⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠛⠛⠛⠉⠋⠉⠙⠛⠛⠛⠛⠿⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡇⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣀⣀⣿⡿⠿⠛⠋⢉⣁⠤⠤⠖⠒⠋⠉⠉⠉⠉⠙⠒⠤⣉⠉⠀⠀⠀⠀⠉⠙⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡇⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⠿⠛⠛⠛⠛⠛⠛⠉⠀⠀⠀⠐⠛⠰⠶⠶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠑⢦⡀⠀⠀⠀⠀⠀⠀⠈⠙⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠃⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠠⣄⣀⣀⣠⣤⣤⣤⣤⣤⣤⣤⣬⣉⣭⣿⣷⣶⡶⢠⣤⣤⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠈⠲⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠟⠛⠛⠛⠛⠛⠛⠛⠻⠿⠿⠶⢶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⣿⣿⣿⣿⣿⠿⠿⠿⠿⢿⣿⣿⣿⣿⣿⣿⠿⠇⠸⠁⠀⠀⠹⠿⠿⠿⠿⠿⠿⠿⠿⠿⠿⣿⣿⡄⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠛⠻⠷⣶⣶⠀⠀⠀⠀⠀⠈⠉⠙⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀⢰⣿⣿⠟⠋⠀⠀⠀⠀⠀⠀⠈⠛⣿⣿⠉⠀⢀⣤⠀⣶⣶⣶⣶⣿⣿⣿⣶⣶⣶⣶⣶⣶⣤⣤⣄⡁⠈⠛⢿⣿⣿⡿⠿⠿⠟⠋⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⣤⡀⠀⠀⠀⠀⠉⠒⢤⡈⠙⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⡄⠀⢻⣿⣧⠹⣿⣿⣿⣿⣿⡿⠿⠿⠿⠿⣿⣿⣿⣿⣿⣿⠠⡄⠀⢹⣿⣿⣿⣿⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣿⣷⣦⣤⣄⣀⣠⣄⢹⣷⣄⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠘⢿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣄⠀⠙⠿⣧⡘⢿⣿⣿⣿⣿⣿⣶⣶⣶⣶⣤⣤⣤⣌⣉⠀⡉⠀⠀⢿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⡟⠋⡉⠉⠈⠉⠉⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⠁⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠸⠿⠿⠿⠶⠦⠤⠤⠤⠤⠤⠤⢤⡤⠄⣈⣉⣉⣉⣉⣉⠉⠉⠀⠉⠁⠀⠈⣛⣛⡃⠀⠀⠀⠀⠀⠈⠃⠀⠀⠀⠀⠀⢰⣿⣿⣿⡿⠀⠊⠀⠀⠀⠀⠀⠰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣤⣄⡀⠀⠀⠀⠀⠀⠐⠀⠀⠀⠀⣸⣿⣿⣶⠖⠒⠒⠒⠒⠒⠒⠒⠶⠶⠶⠤⠤⠤⠤⠤⠤⠤⠤⠤⠀⠀⣀⣀⣉⢉⡃⠀⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣷⣤⣤⣤⡄⠀⠄⠀⠀⣹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣤⡤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⠤⣤⢤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠠⠤⠤⠤⠤⢤⣤⣴⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⣴⣶⣶⣶⣶⣶⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣶⣶⣶⣶⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠛⢿⣿⣿⣿⣿⠟⠛⠛⠛⠛⢿⣿⠿⠛⠛⠛⠛⠿⣿⠟⠛⠛⠛⠛⠻⢿⡟⠛⠛⠛⠛⠛⠻⣿⠟⠛⠛⠛⠛⢿⣿⡿⠛⠛⠛⠛⠻⣿⣿⣿⡟⣿⡟⠻⣿⣿⣿⣿⠛⣿⡿⠛⠛⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⢻⣿⣿⣿⡇⢠⣶⣶⣶⣦⠀⡏⠀⣶⣶⠶⠶⠤⣽⠀⠲⠶⠶⠶⠆⢸⡇⠰⠶⠶⠶⠆⠀⣿⠀⣶⣶⣶⣶⠀⣿⠀⣴⣶⠶⠶⠤⣼⣿⣿⡇⣿⡇⢠⡈⠙⢿⣿⠀⣿⠀⣴⣶⣶⣶⣄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠸⠿⠿⠿⡇⠐⠿⠿⠿⠟⢀⣇⠀⠿⠷⠴⠆⠀⣿⠀⢤⣤⣤⣤⣤⣾⡇⠠⣤⣤⣤⡄⠀⣇⠀⠿⠿⠿⠿⠀⣿⠀⠻⠿⠤⠶⠀⣸⣿⣿⡇⢿⡇⢸⣿⣦⣀⠉⠀⣿⠀⠻⠿⠿⠿⠋⣹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣶⣶⣶⣿⣶⣶⣶⣶⣶⣾⣿⣶⣶⣶⣶⣶⣾⣿⣦⣾⣿⣿⣿⣿⣿⣧⣴⣿⣿⣿⣷⣤⣿⣶⣶⣶⣶⣶⣾⣿⣷⣶⣶⣶⣶⣶⣿⣿⣿⣧⣾⣧⣴⣿⣿⣿⣷⣤⣿⣷⣶⣶⣶⣶⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⢉⡙⣿⣿⣿⣿⣿⠟⠛⠛⢿⣿⡟⢻⣿⡟⠛⠛⠛⣿⣿⠟⠛⠛⢻⡟⠛⠛⢻⡟⠻⣿⠛⡟⠛⠛⠻⣿⠏⢻⣿⠟⢻⣿⣿⣿⣿⣿⣿⠉⡉⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠸⡀⠻⠿⣿⣿⣿⠀⠛⠗⢸⠋⣀⣀⠙⡇⢨⣬⠀⣿⣿⠀⣠⣄⠘⡇⠀⠀⢸⡇⢠⣈⠀⣿⡃⢸⣿⠋⢀⡀⠛⡇⠻⠟⢿⣿⣿⠿⠟⠀⠁⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣤⣉⡛⠲⠦⢬⣍⣛⠛⠿⠿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣶⣿⣿⣾⣿⣿⣿⣿⣷⣿⣿⣾⣿⣷⣾⣿⣿⣿⣿⠷⠿⠛⢋⣉⡁⠠⠖⢂⣀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣦⣤⣍⣙⠓⠲⠤⣬⣉⡛⠛⠿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠟⠛⣉⡩⠤⠔⠚⣃⣀⣤⣴⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣦⣬⣉⣛⠒⠶⢤⣍⣙⡛⠻⠿⣿⣿⣿⠿⠟⠛⣋⣉⡤⠴⠒⢈⣉⣡⣤⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⣭⣉⡛⠲⠤⣤⠤⠀⠒⣉⣡⣤⣴⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
       ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿''')

car_dict = {}
# Main Menu
def display_main_menu():
        print("\033[1;31m===================================================================================================================================================")
        print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝓦𝓮𝓵𝓬𝓸𝓶𝓮 𝓽𝓸 𝓛𝓸𝓰𝓹𝓻𝓸𝓰 𝓘𝓷𝓬𝓸𝓻𝓹𝓸𝓻𝓪𝓽𝓲𝓸𝓷                                                               ")
        print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝐖𝐡𝐞𝐫𝐞 𝐞𝐯𝐞𝐫𝐲 𝐫𝐢𝐝𝐞 𝐢𝐬 𝐩𝐫𝐨𝐠𝐫𝐚𝐦𝐦𝐞𝐝 𝐟𝐨𝐫 𝐩𝐞𝐫𝐟𝐞𝐜𝐭𝐢𝐨𝐧")
        print("===================================================================================================================================================")

        print(f"\033[1;31m[1] 𝐑𝐞𝐧𝐭 𝐚 𝐂𝐚𝐫")
        print("[2] 𝐑𝐞𝐭𝐮𝐫𝐧 𝐚 𝐂𝐚𝐫")
        print("[0] 𝐄𝐱𝐢𝐭")

# Car Rental
def rent_a_car():
    print("---------------------------------------------------------------------------------------------------------------------------------------------------")
    print("\033[1:31m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝔖𝔢𝔩𝔢𝔠𝔱 𝔱𝔥𝔢 𝔗𝔶𝔭𝔢 𝔬𝔣 ℭ𝔞𝔯                                                               ")
    print("===================================================================================================================================================")
    print("[1] 𝐒𝐩𝐨𝐫𝐭𝐬 𝐂𝐚𝐫")
    print("[2] 𝐅𝐚𝐦𝐢𝐥𝐲 𝐂𝐚𝐫")
    print("[3] 𝐔𝐭𝐢𝐥𝐢𝐭𝐲 𝐕𝐞𝐡𝐢𝐜𝐥𝐞𝐬")
    print("[4] 𝐄𝐥𝐞𝐜𝐭𝐫𝐢𝐜 𝐂𝐚𝐫")
    print("[𝙴𝚗𝚝𝚎𝚛 0 𝚒𝚏 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚝𝚘 𝚐𝚘 𝚋𝚊𝚌𝚔 𝚝𝚘 𝚝𝚑𝚎 𝚙𝚛𝚎𝚟𝚒𝚘𝚞𝚜 𝚌𝚑𝚘𝚒𝚌𝚎]")
    print("---------------------------------------------------------------------------------------------------------------------------------------------------")
    car_type_choice = input("𝑬𝒏𝒕𝒆𝒓 𝒚𝒐𝒖𝒓 𝑪𝒉𝒐𝒊𝒄𝒆: ")
    print("---------------------------------------------------------------------------------------------------------------------------------------------------")

    if car_type_choice == "1":
        display_car_choices(sports_car, "𝓢𝓟𝓞𝓡𝓣𝓢 𝓒𝓐𝓡𝓢")
    elif car_type_choice == "2":
        display_car_choices(family_car, "𝓕𝓐𝓜𝓘𝓛𝓨 𝓒𝓐𝓡𝓢")
    elif car_type_choice == "3":
        display_car_choices(utility_vehicles, "𝓤𝓣𝓘𝓛𝓘𝓣𝓨 𝓥𝓔𝓗𝓘𝓒𝓛𝓔𝓢")
    elif car_type_choice == "4":
        display_car_choices(electric_car, "𝓔𝓛𝓔𝓒𝓣𝓡𝓘𝓒 𝓒𝓐𝓡𝓢")
    elif car_type_choice == "0":
        return
    else:
        print("Invalid choice. Please try again.")
        rent_a_car()


# Function to display cars from a given dictionary
def display_car_choices(car_dict, category):
    print("\033[1:36m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t{category}                                                                       ")
    print("===================================================================================================================================================")
    for item, details in car_dict.items():
        if not details['rented']:
            print(f"{item:<20}: Daily Rent - ₱{details['daily_rent']:>5,.2f} | Registration Number - {details['registration_number']:>3} | Transmission - {details['transmission']:>10} | Seats - {details['seats']:>2} | Exterior Color - {details['exterior_color']:>5}")
    print("---------------------------------------------------------------------------------------------------------------------------------------------------")
    print("[𝙴𝚗𝚝𝚎𝚛 0 𝚒𝚏 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚝𝚘 𝚐𝚘 𝚋𝚊𝚌𝚔 𝚝𝚘 𝚝𝚑𝚎 𝚙𝚛𝚎𝚟𝚒𝚘𝚞𝚜 𝚌𝚑𝚘𝚒𝚌𝚎]")

    while True:
        car_choice = input("𝙴𝚗𝚝𝚎𝚛 𝚝𝚑𝚎 𝚗𝚊𝚖𝚎 𝚘𝚏 𝚝𝚑𝚎 𝚌𝚊𝚛 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚝𝚘 𝚛𝚎𝚗𝚝: ").lower()
        print("---------------------------------------------------------------------------------------------------------------------------------------------------")
        if car_choice == "0":
            return rent_a_car()
        elif car_choice in (key.lower() for key in car_dict.keys()):
            actual_key = next(key for key in car_dict if key.lower() == car_choice)
            if car_dict[actual_key]['rented']:
                print("This car is already rented. Please choose another car.")
            else:
                enter_personal_details(car_dict[actual_key])
                break
        else:
            print("Invalid choice. Please try again.")


# Personal Details
def enter_personal_details(selected_car):
    print("\033[1:36m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝕰𝖓𝖙𝖊𝖗 𝕻𝖊𝖗𝖘𝖔𝖓𝖆𝖑 𝕯𝖊𝖙𝖆𝖎𝖑𝖘                                                      ")
    print("===================================================================================================================================================")
    print("[𝙴𝚗𝚝𝚎𝚛 0 𝚒𝚏 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚝𝚘 𝚐𝚘 𝚋𝚊𝚌𝚔 𝚝𝚘 𝚝𝚑𝚎 𝚙𝚛𝚎𝚟𝚒𝚘𝚞𝚜 𝚌𝚑𝚘𝚒𝚌𝚎]")
    while True:
        name = input("𝙴𝚗𝚝𝚎𝚛 𝚢𝚘𝚞𝚛 𝚗𝚊𝚖𝚎: ")
        if name == "0":
            return rent_a_car()
        else:
            break

    while True:
        rental_days_str = input("𝙴𝚗𝚝𝚎𝚛 𝚝𝚑𝚎 𝚗𝚞𝚖𝚋𝚎𝚛 𝚘𝚏 𝚛𝚎𝚗𝚝𝚊𝚕 𝚍𝚊𝚢𝚜: ")
        if rental_days_str == "0":
            return rent_a_car()
        elif rental_days_str.isdigit():
            rental_days = int(rental_days_str)
            if rental_days <= 0:
                print("Rental days must be greater than 0. Please enter a valid number.")
            else:
                selected_car['rental_days'] = rental_days
                break
        else:
            print("Invalid input.")

    while True:
        age = input("𝙿𝚕𝚎𝚊𝚜𝚎 𝚎𝚗𝚝𝚎𝚛 𝚢𝚘𝚞𝚛 𝚊𝚐𝚎: ")
        print(
            "---------------------------------------------------------------------------------------------------------------------------------------------------")
        if age == "0":
            return rent_a_car()
        elif age.isdigit():
            age = int(age)
            if age < 18:
                print("You must be at least 18 years old to rent a vehicle")
            else:
                break
        else:
            print("Invalid input. Please enter a valid age.")

    calculate_rental_cost(selected_car, rental_days, age, name)
    car_dict[selected_car['registration_number']] = selected_car


# Calculate Rental Cost
def calculate_rental_cost(selected_car, rental_days, age, name):
    base_rental_cost = selected_car["daily_rent"] * rental_days
    if age >= 60:
        discount = 0.15 * base_rental_cost
    else:
        discount = 0
    total_rental_cost = base_rental_cost - discount

    print("\033[1:36m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tℜ𝔢𝔫𝔱𝔞𝔩 ℭ𝔬𝔰𝔱 𝔖𝔲𝔪𝔪𝔞𝔯𝔶                                                        ")
    print("===================================================================================================================================================")
    print(f"𝐁𝐚𝐬𝐞 𝐑𝐞𝐧𝐭𝐚𝐥 𝐂𝐨𝐬𝐭: ₱{base_rental_cost:,.2f}")
    print(f"𝐃𝐢𝐬𝐜𝐨𝐮𝐧𝐭: ₱{discount:,.2f}")
    print(f"𝐓𝐨𝐭𝐚𝐥 𝐑𝐞𝐧𝐭𝐚𝐥 𝐂𝐨𝐬𝐭: ₱{total_rental_cost:,.2f}")

    while True:
        payment_str = input("𝙴𝚗𝚝𝚎𝚛 𝚢𝚘𝚞𝚛 𝚙𝚊𝚢𝚖𝚎𝚗𝚝: ")
        if payment_str.isdigit():
            payment = int(payment_str)
            if payment < total_rental_cost:
                print("Insufficient payment. Please try again.")
            else:
                change = payment - total_rental_cost
                print(f"Change: ₱{change:,.2f}")
                print("---------------------------------------------------------------------------------------------------------------------------------------------------")
                confirm_rental(selected_car, rental_days, name)
                break
        else:
            print("Invalid input. Please enter a valid payment amount.")


# Confirm Rental
def confirm_rental(selected_car, rental_days, name):
    print("\033[1:36m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tℜ𝔢𝔫𝔱𝔞𝔩 ℭ𝔬𝔫𝔣𝔦𝔯𝔪𝔞𝔱𝔦𝔬𝔫                                                           ")
    print("===================================================================================================================================================")
    print(f"𝐂𝐚𝐫 𝐓𝐲𝐩𝐞: {selected_car['name']}")
    print(f"𝐑𝐞𝐧𝐭𝐚𝐥 𝐃𝐚𝐲𝐬: {rental_days} days")
    print(f"𝐍𝐚𝐦𝐞: {name}")
    print(f"𝐑𝐞𝐠𝐢𝐬𝐭𝐫𝐚𝐭𝐢𝐨𝐧 𝐍𝐮𝐦𝐛𝐞𝐫: {selected_car['registration_number']}")
    print(f"T𝐫𝐚𝐧𝐬𝐦𝐢𝐬𝐬𝐢𝐨𝐧: {selected_car['transmission']}")
    print(f"𝐒𝐞𝐚𝐭𝐬: {selected_car['seats']}")
    print(f"𝐄𝐱𝐭𝐞𝐫𝐢𝐨𝐫 𝐂𝐨𝐥𝐨𝐫: {selected_car['exterior_color']}")

    while True:
        confirm = input("𝙰𝚛𝚎 𝚢𝚘𝚞 𝚜𝚞𝚛𝚎 𝚊𝚋𝚘𝚞𝚝 𝚢𝚘𝚞𝚛 𝚛𝚎𝚗𝚝𝚊𝚕 (𝚢/𝚗): ").lower()
        print("---------------------------------------------------------------------------------------------------------------------------------------------------")
        if confirm == "y":
            final_output("rental")
            selected_car['rented'] = True
            break
        elif confirm == "n":
            enter_personal_details(selected_car)
            break
        else:
            print("Invalid choice. Please try again.")


# Return a Car
def return_a_car(car_dict):
    print("\033[1:36m===================================================================================================================================================")
    print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tℭ𝔞𝔯 ℜ𝔢𝔱𝔲𝔯𝔫 𝔓𝔯𝔬𝔠𝔢𝔰𝔰                                                                ")
    print("===================================================================================================================================================")
    print("[𝙴𝚗𝚝𝚎𝚛 0 𝚒𝚏 𝚢𝚘𝚞 𝚠𝚊𝚗𝚝 𝚝𝚘 𝚐𝚘 𝚋𝚊𝚌𝚔 𝚝𝚘 𝚝𝚑𝚎 𝚙𝚛𝚎𝚟𝚒𝚘𝚞𝚜 𝚌𝚑𝚘𝚒𝚌𝚎]")
    print("---------------------------------------------------------------------------------------------------------------------------------------------------")
    registration_number = input("𝙴𝚗𝚝𝚎𝚛 𝚝𝚑𝚎 𝚛𝚎𝚐𝚒𝚜𝚝𝚛𝚊𝚝𝚒𝚘𝚗 𝚗𝚞𝚖𝚋𝚎𝚛 𝚘𝚏 𝚝𝚑𝚎 𝚟𝚎𝚑𝚒𝚌𝚕𝚎: ")
    if registration_number == "0":
        return
    for car_name, vehicle in car_dict.items():
        if vehicle["registration_number"] == registration_number:
            if vehicle['rented']:
                print("Vehicle found.")
                while True:
                    rental_days_str = input("𝙴𝚗𝚝𝚎𝚛 𝚝𝚑𝚎 𝚗𝚞𝚖𝚋𝚎𝚛 𝚘𝚏 𝚛𝚎𝚗𝚝𝚊𝚕 𝚍𝚊𝚢𝚜: ")
                    if rental_days_str.isdigit():
                        rental_days = int(rental_days_str)
                        if rental_days <= 0:
                            print("Rental days must be greater than 0. Please enter a valid number.")
                        else:
                            break
                    else:
                        print("Invalid input.")
                if rental_days > vehicle['rental_days']:
                    additional_fee = (rental_days - vehicle['rental_days']) * vehicle['daily_rent']
                    print(f"Additional fee: ₱{additional_fee:,.2f}")
                    while True:
                        payment_str = input("Enter your payment: ")
                        if payment_str.isdigit():
                            payment = int(payment_str)
                            if additional_fee > payment:
                                print("Insufficient payment. Please try again.")
                            else:
                                change = payment - additional_fee
                                print(f"Change: ₱{change:,.2f}")
                                final_output("return")
                                vehicle['rented'] = False
                                return True
                        else:
                            print("Invalid input. Please enter a valid payment amount.")
                else:
                    print("Rental days match. No additional fee required.")
                    final_output("return")
                    vehicle['rented'] = False
                    return True
    print("Vehicle not found. Please try again.")
    return return_a_car(car_dict)


# Final Output
def final_output(action):
    if action == "rental":
        print("\033[1:36m===================================================================================================================================================")
        print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝐓𝐡𝐚𝐧𝐤 𝐲𝐨𝐮 𝐟𝐨𝐫 𝐑𝐞𝐧𝐭𝐢𝐧𝐠 𝐰𝐢𝐭𝐡 𝐮𝐬!                                                       ")
        print("===================================================================================================================================================")
    elif action == "return":
        print("===================================================================================================================================================")
        print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t𝐓𝐡𝐚𝐧𝐤 𝐲𝐨𝐮 𝐟𝐨𝐫 𝐑𝐞𝐭𝐮𝐫𝐧𝐢𝐧𝐠 𝐨𝐮𝐫 𝐕𝐞𝐡𝐢𝐜𝐥𝐞!                                                    ")
        print("===================================================================================================================================================")


# Define car dictionaries
sports_car = {
    "Subaru BRZ": {"name": "Subaru BRZ", "daily_rent": 7500, "registration_number": "SP1", "rented": False,
                   "rental_days": 0, "transmission": "Manual", "seats": 2, "exterior_color": "Red"},
    "Chevrolet Corvette": {"name": "Chevrolet Corvette", "daily_rent": 8000, "registration_number": "SP2",
                           "rented": False, "rental_days": 0, "transmission": "Automatic", "seats": 2, "exterior_color": "Blue"},
    "Ford Mustang": {"name": "Ford Mustang", "daily_rent": 8000, "registration_number": "SP3", "rented": False,
                     "rental_days": 0, "transmission": "Manual", "seats": 2, "exterior_color": "Gray"}
}

family_car = {
    "Mitsubishi Xpander": {"name": "Mitsubishi Xpander", "daily_rent": 4500, "registration_number": "FM1",
                           "rented": False, "rental_days": 0, "transmission": "Automatic", "seats": 7, "exterior_color": "Silver"},
    "Toyota Rush": {"name": "Toyota Rush", "daily_rent": 4500, "registration_number": "FM2", "rented": False,
                    "rental_days": 0, "transmission": "Manual", "seats": 5, "exterior_color": "Black"},
    "Montero Sport": {"name": "Montero Sport", "daily_rent": 5000, "registration_number": "FM3", "rented": False,
                      "rental_days": 0, "transmission": "Automatic", "seats": 7, "exterior_color": "White"}
}

utility_vehicles = {
    "Mitsubishi L300": {"name": "Mitsubishi L300", "daily_rent": 2000, "registration_number": "UT1", "rented": False,
                        "rental_days": 0, "transmission": "Manual", "seats": 3, "exterior_color": "Blue"},
    "Hiace Cargo": {"name": "Hiace Cargo", "daily_rent": 2500, "registration_number": "UT2", "rented": False,
                    "rental_days": 0, "transmission": "Automatic", "seats": 3, "exterior_color": "White"},
    "Suzuki Carry": {"name": "Suzuki Carry", "daily_rent": 1800, "registration_number": "UT3", "rented": False,
                     "rental_days": 0, "transmission": "Manual", "seats": 2, "exterior_color": "Red"}
}

electric_car = {
    "Hyundai IONIQ": {"name": "Hyundai IONIQ", "daily_rent": 9000, "registration_number": "EC1", "rented": False,
                      "rental_days": 0, "transmission": "Automatic", "seats": 5, "exterior_color": "Silver"},
    "Nissan Leaf": {"name": "Nissan Leaf", "daily_rent": 9500, "registration_number": "EC2", "rented": False,
                    "rental_days": 0, "transmission": "Automatic", "seats": 5, "exterior_color": "Black"},
    "BYD E6": {"name": "BYD E6", "daily_rent": 9500, "registration_number": "EC3", "rented": False, "rental_days": 0,
               "transmission": "Automatic", "seats": 5, "exterior_color": "White"}
}

# Program Main
run_program = True
while run_program:
    display_main_menu()
    choice = input("𝑬𝒏𝒕𝒆𝒓 𝒚𝒐𝒖𝒓 𝒄𝒉𝒐𝒊𝒄𝒆: ")
    if choice == "1":
        rent_a_car()
    elif choice == "2":
        if return_a_car(car_dict):
            continue
    elif choice == "0":
        while True:
            exit_program = input("𝙴𝚡𝚒𝚝 𝚝𝚑𝚎 𝚙𝚛𝚘𝚐𝚛𝚊𝚖? (𝚢𝚎𝚜/𝚗𝚘): ").lower()
            print("---------------------------------------------------------------------------------------------------------------------------------------------------")
            if exit_program == "yes":
                print("===================================================================================================================================================")
                print(f"\t\t\t\t\t\t\t\t\t\t\t\t\t𝐓𝐡𝐚𝐧𝐤 𝐲𝐨𝐮 𝐟𝐨𝐫 𝐮𝐬𝐢𝐧𝐠 𝐨𝐮𝐫 𝐀𝐩𝐩𝐥𝐢𝐜𝐚𝐭𝐢𝐨𝐧!                                                                ")
                print("===================================================================================================================================================")
                run_program = False
                break
            elif exit_program == "no":
                break
            else:
                print("Invalid input. Please enter 'yes' or 'no'.")
    else:
        print("Invalid choice. Please try again.")
